Main.org
#+TITLE:        Willingness-To-Pay for Reshuffling Geographical Indications
#+AUTHOR:       Jean-Sauveur Ay\\ [[mailto:jsay.site@gmail.com][jsay@inrae.fr]]
#+OPTIONS:      LaTeX:t tags:nil toc:nil
#+LaTeX_CLASS:  ManueStat
#+LANGUAGE:     en
#+STARTUP:      hideblocks
#+HTML_HEAD:    <link rel="stylesheet" type="text/css" href="http://thomasf.github.io/solarized-css/solarized-light.min.css" />
#+DRAWERS:      PROPERTIES BABEL BIND LATEX MACRO
:BABEL:
#+PROPERTY:     header-args :session *R* :exports both :eval no :results output
:END:
:BIND:
#+BIND:         org-latex-image-default-width ""
#+BIND:         org-latex-tables-booktabs t
:END:
:LATEX:
#+LaTex_CLASS:  ManueStat
#+LaTeX_HEADER: \parindent 20pt \parskip 1ex  
#+COLUMNS:      %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)
#+LaTeX_HEADER: \usepackage[utf8]{inputenc} \usepackage[flushleft]{threeparttable} \newcommand\crule[3][black]{\textcolor{#1}{\rule{#2}{#3}}}
#+LaTeX_HEADER: \usepackage{tabularx, rotating, booktabs, lscape, tikz, dcolumn, amssymb, amsmath, amsthm, bbm, eurosym, threeparttable,pdflscape, txfonts, rotfloat}
#+LaTeX_HEADER: \usetikzlibrary{calc,trees,positioning,arrows,chains,shapes.geometric, decorations.pathreplacing,decorations.pathmorphing,shapes, matrix,shapes.symbols}
#+LaTeX_HEADER: \newcolumntype{Y}{>{\raggedleft\arraybackslash}X} \usepackage{caption} \captionsetup{font={stretch=.7}, position=top} \newcommand{\indep}{\;\rotatebox[origin=c]{90}{$\models$}\;}
:END:

* Replication
  :PROPERTIES:
  :EXPORT_FILE_NAME:    Replication
  :EXPORT_LATEX_CLASS:  ManueStat
  :EXPORT_OPTIONS:      TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc toc:nil H:3
  :EXPORT_TITLE:        @@latex: \vspace{-1.5cm} \huge Willingness-To-Pay for Reshuffling\\ Geographical Indications \vspace{1cm}@@
  :EXPORT_DATE:         @@latex: Replication Material V2.1, \today @@ 
  :EXPORT_AUTHOR:       @@latex:\begin{tabular}{ccc} Monia SAÏDI\footnote{UMR CESAER : AgroSup Dijon, INRAE, Univ. Bourgogne Franche-Comté, F-21000 Dijon.} &\hspace*{1.5cm}& Jean-Sauveur AY$^*$ \\  \url{monia.saidi@inrae.fr} && \url{jean-sauveur.ay@inrae.fr} \\ &&\\ Stéphan MARETTE\footnote{UMR ECOPUB : AgroParisTech, INRAE, Univ. Paris Saclay, F-75000 Paris.} && Christophe MARTIN\footnote{UMR CSGA : CNRS, INRAE, Univ. Bourgogne Franche-Comté, F-21000 Dijon.}\\ \url{stephan.marette@inrae.fr} && \url{christophe.martin@inrae.fr}\\ &&\end{tabular}@@
  :EXPORT_LATEX_HEADER: \newcommand{\verbatimfont}[1]{\renewcommand{\verbatim@font}{\ttfamily#1}} \usepackage[T1]{fontenc}\usepackage{tabularx, rotating, booktabs, lscape, tikz, dcolumn, amssymb, amsmath, amsthm, bbm, eurosym, threeparttable, pdflscape, txfonts, rotfloat}  \usepackage{tocloft} \usepackage[toc]{multitoc}\renewcommand*{\multicolumntoc}{2}\setlength{\columnseprule}{.5pt}\setlength{\columnsep}{1cm}
  :END:
** Abstract                                  :noheading:
#+BEGIN_abstract
This file contents the Replication Material (RM) associated to the
article named in the title and under revision in the /Journal of Wine
Economics/.  Data, code, figures, and tables are under the copyright
license GNU GPL V3, which means that license notices must be
preserved.  Raw data are available from the Inrae dataverse server
[[https://data.inra.fr/dataset.xhtml?persistentId=doi:10.15454/5ICGGD][https://data.inrae.fr]].  The most recent version of this document and
the detailed experimental protocol are available from the remote
repository [[https://github.com/jsay/reshufGI/][https://github.com/jsay/reshufGI]].
#+END_abstract
#+TOC: headlines 3
#+Latex: \clearpage
** Data preparation
*** Individual data

    The data about elicited Willingness-To-Pay (WTP) are available on
    the Inrae dataverse: [[https://data.inra.fr/dataset.xhtml?persistentId=doi:10.15454/5ICGGD][https://data.inrae.fr]].  The file =WTPraw.csv=
    can be downloaded by hand, or loaded directly in =R= with the
    =dataverse= package [Leeper, T. J. (2017). dataverse: R Client for
    Dataverse 4. R package version 0.2.0.] as below.

#+begin_src R :wrap example
library(dataverse)
Sys.setenv("DATAVERSE_SERVER" = "data.inrae.fr")
WTPraw <- get_file("WTPraw.csv", " https://doi.org/10.15454/5ICGGD")
writeBin(WTPraw, "WTPraw.csv")
#+end_src

    The dataset contains 125 rows (one row for each participant) and
    37 columns (one for each question/ answer).  The first variable is
    the ID of the participant, the second variable is the result from
    the simulation at the beginning of the experiment in order to
    explain the BDM mechanism to the participants, the next 15
    variables (between column 3 and column 17) correspond to the
    declared Willingness-To-Pay (WTP) that were asked for 3 different
    GI levels (=REG=, =VIL=, and =PCRU=) for each of the 5 different
    scenarios proposed to each participants.  The last 20 columns
    corresponds to intermediary questions that could be used to
    control participants' heterogeneity.  The detailed survey of the
    experiment is available [[https://github.com/jsay/reshufGI/blob/master/ENprotocol.pdf][here]].

    We re-code below the names of the WTP variables to melt them, and
    obtain a pooled data table of 1875 rows and 3 columns.

#+begin_src R :wrap example
library(data.table)
dim(DT1 <- fread("Data/WTPraw.csv"))
names(DT1)[ 3: 17] <- paste0("X", substr(names(DT1)[ 3: 17], 2, 5))
dim(LDT1 <- melt(DT1, id.vars= "ID", measure.vars= names(DT1)[ 3: 17],
                 variable.name= "CHOIX", value.name= "WTP"))
LDT1$IDST <- paste(substr(LDT1$ID, 1, 3),
                   substr(LDT1$CHOIX, 1, 2), sep= "")
#+end_src

#+RESULTS:
#+begin_example
data.table 1.11.4  Latest news: http://r-datatable.com

[1] 125  37

[1] 1875    3
#+end_example

    These melted data contain the pooled WTP that are used in the
    regressions, as presented in the paper.

#+Latex: \clearpage

*** Scenario data

    We also use the file =SCCraw.csv= about the characteristics of the
    scenario of GI changes that we propose to the participants.  As
    before, this file can be downloaded by hand or with the
    =dataverse= package.

    We perform 10 group sessions with 5 scenarios on each, so data
    have 50 rows.  Every scenarios is replicated on average 4 times,
    as we have 14 different scenarios about GI reshuffling on the area
    of /Marsannay/.  The variable =STRUCT= reports 28 unique values
    because the 14 scenarios are present with and without the bottle
    of /Fixin Premier Cru/, each appear twice.  We merge below the
    scenario characteristics with previous WTP data elicited from the
    experiment.

#+begin_src R :wrap example
SCCraw <- get_file("SCCraw.csv", " https://doi.org/10.15454/5ICGGD")
writeBin(SCCraw, "SCCraw.csv")
dim(SCC <- fread("Data/SCCraw.csv"))
length(unique(SCC$STRUCT))
SCC$IDST <- paste0(substr(SCC$GROUPE, 1, 3), "X", substr(SCC$GROUPE, 5, 5))
dim(DatPool <- merge(LDT1, SCC[, -1], by= "IDST"))
#+end_src

#+RESULTS:
#+begin_example
[1] 50  2

[1] 28

[1] 1875    5
#+end_example

*** AOC variables

    We compute 3 series of variables that are used in the
    regressions.  The first series is about the GI variables that are
    both coded as =factor= in the =AOC= variable and as =dummies= in
    the =AOCREG=, =AOCVIL=, and =AOCPCR= variables.  Next, we compute
    the number of wine bottle in each GI for each scenario for the
    =STRUCT= variable from scenarios characteristics.  Finally, we
    code the =FIXIN= dummy variable that equals to 1 for participant
    for which the /Fixin Premier Cru/ was present.  The code below
    reports the distribution of dummy variables.

#+begin_src R :wrap example
DatPool$AOC <- factor(substr(DatPool$CHOIX, 3, 5),
                      levels= c("REG", "VIL", "PCR"))
DatPool$AOCREG <- ifelse(DatPool$AOC== "REG", 1, 0)
DatPool$AOCVIL <- ifelse(DatPool$AOC== "VIL", 1, 0)
DatPool$AOCPCR <- ifelse(DatPool$AOC== "PCR", 1, 0)
DatPool$NBREG <- as.numeric(substr(DatPool$STRUCT, 5, 5))
DatPool$NBVIL <- as.numeric(substr(DatPool$STRUCT, 3, 3))
DatPool$NBPCR <- as.numeric(substr(DatPool$STRUCT, 1, 1))
DatPool$FIXIN <- ifelse(rowSums(DatPool[, 10: 12])== 11, 1, 0)
sapply(DatPool[, c(7: 9, 13)], table, simplify= TRUE)
#+end_src

#+RESULTS:
#+begin_example
  AOCREG AOCVIL AOCPCR FIXIN
0   1250   1250   1250   900
1    625    625    625   975
#+end_example

