Replication.md
<div class="abstract">
This file contents the Replication Material (RM) associated to the article named in the title and under revision in the *Journal of Wine Economics*. Data, code, figures, and tables are under the copyright license GNU GPL V3, which means that license notices must be preserved. Raw data are available from the Inrae dataverse server [https://data.inrae.fr](https://data.inra.fr/dataset.xhtml?persistentId=doi:10.15454/5ICGGD). The most recent version of this document and the detailed experimental protocol are available from the remote repository [https://github.com/jsay/reshufGI](https://github.com/jsay/reshufGI/).

</div>


# Table of Contents

1.  [Data preparation](#org284e67c)
    1.  [Individual data](#org90888a3)
    2.  [Scenario data](#org6a05ea3)
    3.  [AOC variables](#orga04df3e)
    4.  [Wine dummies](#org6be38f9)
    5.  [Average score](#org7e70190)
    6.  [Score variance](#orgf81e4e6)
    7.  [Summary Table](#orgbeb77be)
2.  [Regression analysis](#org66a7339)
    1.  [Table SM1 cited in the paper](#org7946692)
    2.  [Table SM2 cited in the paper](#org1ecfc2c)
    3.  [Table SM3 cited in the paper](#org03c10ed)
    4.  [Table 3 in the paper](#org5e46693)
3.  [Figures](#org2c0f4ad)
    1.  [Figure 1](#org9f8a2fa)
    2.  [Figure 2 color](#orgd9d2323)
    3.  [Figure 2 black and white](#orgc0ac3a5)
4.  [Appendix](#orge8ec1d0)
    1.  [Function for ternary plots](#orgedb4181)
    2.  [Function for ternary plots black and white](#org09c254b)


<a id="org284e67c"></a>

# Data preparation


<a id="org90888a3"></a>

## Individual data

The data about elicited Willingness-To-Pay (WTP) are available on the Inrae dataverse: [https://data.inrae.fr](https://data.inra.fr/dataset.xhtml?persistentId=doi:10.15454/5ICGGD). The file `WTPraw.csv` can be downloaded by hand, or loaded directly in `R` with the `dataverse` package [Leeper, T. J. (2017). dataverse: R Client for Dataverse 4. R package version 0.2.0.] as below.

```R
library(dataverse)
Sys.setenv("DATAVERSE_SERVER" = "data.inrae.fr")
WTPraw <- get_file("WTPraw.csv", " https://doi.org/10.15454/5ICGGD")
writeBin(WTPraw, "WTPraw.csv")
```

The dataset contains 125 rows (one row for each participant) and 37 columns (one for each question/ answer). The first variable is the ID of the participant, the second variable is the result from the simulation at the beginning of the experiment in order to explain the BDM mechanism to the participants, the next 15 variables (between column 3 and column 17) correspond to the declared Willingness-To-Pay (WTP) that were asked for 3 different GI levels (`REG`, `VIL`, and `PCRU`) for each of the 5 different scenarios proposed to each participants. The last 20 columns corresponds to intermediary questions that could be used to control participants' heterogeneity. The detailed survey of the experiment is available [here](https://github.com/jsay/reshufGI/blob/master/ENprotocol.pdf).

We re-code below the names of the WTP variables to melt them, and obtain a pooled data table of 1875 rows and 3 columns.

```R
library(data.table)
dim(DT1 <- fread("Data/WTPraw.csv"))
names(DT1)[ 3: 17] <- paste0("X", substr(names(DT1)[ 3: 17], 2, 5))
dim(LDT1 <- melt(DT1, id.vars= "ID", measure.vars= names(DT1)[ 3: 17],
                 variable.name= "CHOIX", value.name= "WTP"))
LDT1$IDST <- paste(substr(LDT1$ID, 1, 3),
                   substr(LDT1$CHOIX, 1, 2), sep= "")
```

    data.table 1.11.4  Latest news: http://r-datatable.com
    
    [1] 125  37
    
    [1] 1875    3

These melted data contain the pooled WTP that are used in the regressions, as presented in the paper.


<a id="org6a05ea3"></a>

## Scenario data

We also use the file `SCCraw.csv` about the characteristics of the scenario of GI changes that we propose to the participants. As before, this file can be downloaded by hand or with the `dataverse` package.

We perform 10 group sessions with 5 scenarios on each, so data have 50 rows. Every scenarios is replicated on average 4 times, as we have 14 different scenarios about GI reshuffling on the area of *Marsannay*. The variable `STRUCT` reports 28 unique values because the 14 scenarios are present with and without the bottle of *Fixin Premier Cru*, each appear twice. We merge below the scenario characteristics with previous WTP data elicited from the experiment.

```R
SCCraw <- get_file("SCCraw.csv", " https://doi.org/10.15454/5ICGGD")
writeBin(SCCraw, "SCCraw.csv")
dim(SCC <- fread("Data/SCCraw.csv"))
length(unique(SCC$STRUCT))
SCC$IDST <- paste0(substr(SCC$GROUPE, 1, 3), "X", substr(SCC$GROUPE, 5, 5))
dim(DatPool <- merge(LDT1, SCC[, -1], by= "IDST"))
```

    [1] 50  2
    
    [1] 28
    
    [1] 1875    5


<a id="orga04df3e"></a>

## AOC variables

We compute 3 series of variables that are used in the regressions. The first series is about the GI variables that are both coded as `factor` in the `AOC` variable and as `dummies` in the `AOCREG`, `AOCVIL`, and `AOCPCR` variables. Next, we compute the number of wine bottle in each GI for each scenario for the `STRUCT` variable from scenarios characteristics. Finally, we code the `FIXIN` dummy variable that equals to 1 for participant for which the *Fixin Premier Cru* was present. The code below reports the distribution of dummy variables.

```R
DatPool$AOC <- factor(substr(DatPool$CHOIX, 3, 5),
                      levels= c("REG", "VIL", "PCR"))
DatPool$AOCREG <- ifelse(DatPool$AOC== "REG", 1, 0)
DatPool$AOCVIL <- ifelse(DatPool$AOC== "VIL", 1, 0)
DatPool$AOCPCR <- ifelse(DatPool$AOC== "PCR", 1, 0)
DatPool$NBREG <- as.numeric(substr(DatPool$STRUCT, 5, 5))
DatPool$NBVIL <- as.numeric(substr(DatPool$STRUCT, 3, 3))
DatPool$NBPCR <- as.numeric(substr(DatPool$STRUCT, 1, 1))
DatPool$FIXIN <- ifelse(rowSums(DatPool[, 10: 12])== 11, 1, 0)
sapply(DatPool[, c(7: 9, 13)], table, simplify= TRUE)
```

      AOCREG AOCVIL AOCPCR FIXIN
    0   1250   1250   1250   900
    1    625    625    625   975
