Main.org
*** Wine dummies

    We compute the wine dummies in each scenario.  We can verify the
    code by the reported distribution: each wine is proposed 625 times
    (except /Fixin Premier Cru/ that is only for 60% of participants).

#+begin_src R :wrap example
DatPool$VIN0 <- ifelse(DatPool$FIXIN== 1 & DatPool$AOC== "PCR", 1, 0)
DatPool$VIN1 <- ifelse(DatPool$FIXIN== 1,
                ifelse(DatPool$NBPCR>= 2 & DatPool$AOC== "PCR", 1,
                ifelse(DatPool$NBPCR<= 1 & DatPool$AOC== "VIL", 1, 0)),
                ifelse(DatPool$NBPCR>= 1 & DatPool$AOC== "PCR", 1,
                ifelse(DatPool$NBPCR<= 0 & DatPool$AOC== "VIL", 1, 0)))
DatPool$VIN2 <- ifelse(DatPool$FIXIN== 1,
                ifelse(DatPool$NBPCR>= 3 & DatPool$AOC== "PCR", 1,
                ifelse(DatPool$NBPCR<= 2 & DatPool$AOC== "VIL", 1, 0)),
                ifelse(DatPool$NBPCR>= 2 & DatPool$AOC== "PCR", 1,
                ifelse(DatPool$NBPCR<= 1 & DatPool$AOC== "VIL", 1, 0)))
DatPool$VIN3 <- ifelse(DatPool$FIXIN== 1,
                ifelse(DatPool$NBPCR>= 4 & DatPool$AOC== "PCR", 1,
                ifelse(DatPool$NBPCR<= 3 & DatPool$AOC== "VIL", 1, 0)),
                ifelse(DatPool$NBPCR>= 3 & DatPool$AOC== "PCR", 1,
                ifelse(DatPool$NBPCR<= 2 & DatPool$AOC== "VIL", 1, 0)))
DatPool$VIN4 <- ifelse(DatPool$FIXIN== 1,
                ifelse(DatPool$NBPCR>= 5 & DatPool$AOC== "PCR", 1,
                ifelse(DatPool$NBPCR<= 4 & DatPool$AOC== "VIL", 1, 0)),
                ifelse(DatPool$NBPCR>= 4 & DatPool$AOC== "PCR", 1,
                ifelse(DatPool$NBPCR<= 3 & DatPool$AOC== "VIL", 1, 0)))
DatPool$VIN5 <- ifelse(DatPool$AOC== "VIL", 1, 0)
DatPool$VIN6 <- ifelse(DatPool$AOC== "VIL", 1, 0)
DatPool$VIN7 <- ifelse(DatPool$NBREG>= 4 & DatPool$AOC== "REG", 1,
                ifelse(DatPool$NBREG<  4 & DatPool$AOC== "VIL", 1, 0))
DatPool$VIN8 <- ifelse(DatPool$NBREG>= 3 & DatPool$AOC== "REG", 1,
                ifelse(DatPool$NBREG<  3 & DatPool$AOC== "VIL", 1, 0))
DatPool$VIN9 <- ifelse(DatPool$NBREG== 1,
                ifelse(DatPool$AOC== "VIL", 1, 0),
                ifelse(DatPool$AOC== "REG", 1, 0))
DatPool$VIN10<- ifelse(DatPool$AOC== "REG", 1, 0)
sapply(DatPool[, 14: 24], table)
#+end_src

#+RESULTS:
#+begin_example
  VIN0 VIN1 VIN2 VIN3 VIN4 VIN5 VIN6 VIN7 VIN8 VIN9 VIN10
0 1550 1250 1250 1250 1250 1250 1250 1250 1250 1250  1250
1  325  625  625  625  625  625  625  625  625  625   625
#+end_example

#+Latex: \clearpage

*** Average score

    To compute the average score corresponding to each GI, we make the
    analysis for each GIs and then aggregate (see in the paper).

#+begin_src R :wrap example
DatPool$REGscr <- ifelse(DatPool$NBREG== 1, 0,
                  ifelse(DatPool$NBREG== 2, .5,
                  ifelse(DatPool$NBREG== 3, 1, 1.5)))
DatPool$VILscr <- ifelse(DatPool$NBREG== 1,
                   ifelse(DatPool$NBVIL== 6, 3.5, 3),
                  ifelse(DatPool$NBREG== 2,
                   ifelse(DatPool$NBVIL== 4, 3.5,
                   ifelse(DatPool$NBVIL== 5, 4, 4.5)),
                  ifelse(DatPool$NBREG== 3,
                   ifelse(DatPool$NBVIL== 3, 4,      
                   ifelse(DatPool$NBVIL== 4, 4.5,
                   ifelse(DatPool$NBVIL== 5, 5, 5.5))),
                   ifelse(DatPool$NBVIL== 3, 5,
                   ifelse(DatPool$NBVIL== 4, 5.5,
                   ifelse(DatPool$NBVIL== 5, 6,
                   ifelse(DatPool$NBVIL== 6, 6.5, 4.5)))))))
DatPool$PCRscr <- ifelse(DatPool$FIXIN== 1,
                  ifelse(DatPool$NBPCR== 1, 10,
                  ifelse(DatPool$NBPCR== 2, 9.5,
                  ifelse(DatPool$NBPCR== 3, 9,
                  ifelse(DatPool$NBPCR== 4, 8.5,
                  ifelse(DatPool$NBPCR== 5, 8, 8))))),
                  ifelse(DatPool$NBPCR== 1, 9,
                  ifelse(DatPool$NBPCR== 2, 8.5,
                  ifelse(DatPool$NBPCR== 3, 8,
                  ifelse(DatPool$NBPCR== 4, 7.5, 7.5)))))
DatPool$MEAN <- ifelse(DatPool$AOC== "PCR", DatPool$PCRscr,
                ifelse(DatPool$AOC== "VIL", DatPool$VILscr,
                       DatPool$REGscr))
sapply(DatPool[, 25: 28], summary)
#+end_src

#+RESULTS:
#+begin_example
        REGscr VILscr PCRscr   MEAN
Min.     0.000  3.000  7.500  0.000
1st Qu.  1.000  4.500  8.000  1.500
Median   1.500  5.000  8.500  5.000
Mean     1.102  5.102  8.568  4.924
3rd Qu.  1.500  6.000  9.000  8.000
Max.     1.500  6.500 10.000 10.000
#+end_example

#+Latex: \clearpage

*** Score variance

    In two steps, as for the average score above.

#+begin_src R :wrap example
DatPool$REGvar <- ifelse(DatPool$NBREG== 1, 0,
                  ifelse(DatPool$NBREG== 2, .5,
                  ifelse(DatPool$NBREG== 3, 1, 1.667)))
DatPool$VILvar <- ifelse(DatPool$NBVIL== 6, 3.5,
                  ifelse(DatPool$NBVIL== 5, 2.5,
                  ifelse(DatPool$NBVIL== 4, 1.667,
                  ifelse(DatPool$NBVIL== 3, 1, .5))))
DatPool$PCRvar <- ifelse(DatPool$NBPCR== 1 | DatPool$NBPCR== 0, 0,
                  ifelse(DatPool$NBPCR== 2, .005,
                  ifelse(DatPool$NBPCR== 3, .01,
                  ifelse(DatPool$NBPCR== 4, .01667, .025))))* 100
DatPool$VAR <- ifelse(DatPool$AOC== "PCR", DatPool$PCRvar,
               ifelse(DatPool$AOC== "VIL", DatPool$VILvar,
                       DatPool$REGvar))
sapply(DatPool[, 29: 32], summary)
#+end_src

#+RESULTS:
#+begin_example

        REGvar VILvar PCRvar   VAR
Min.     0.000  0.500 0.0000 0.000
1st Qu.  1.000  1.667 0.0000 0.500
Median   1.667  2.500 1.0000 1.667
Mean     1.190  2.430 0.8934 1.504
3rd Qu.  1.667  3.500 1.6670 1.667
Max.     1.667  3.500 2.5000 3.500
#+end_example

#+Latex: \clearpage

*** Summary Table

    We construct here the summary Table 2 of the paper.

#+begin_src R :wrap example
DatPool$WTPreg <- ifelse(DatPool$AOC== "REG", DatPool$WTP, NA)
DatPool$WTPvil <- ifelse(DatPool$AOC== "VIL", DatPool$WTP, NA)
DatPool$WTPpcr <- ifelse(DatPool$AOC== "PCR", DatPool$WTP, NA)

DatPool$SCRreg <- ifelse(DatPool$AOC== "REG", DatPool$MEAN, NA)
DatPool$SCRvil <- ifelse(DatPool$AOC== "VIL", DatPool$MEAN, NA)
DatPool$SCRpcr <- ifelse(DatPool$AOC== "PCR", DatPool$MEAN, NA)

DatPool$VARreg <- ifelse(DatPool$AOC== "REG", DatPool$VAR, NA)
DatPool$VARvil <- ifelse(DatPool$AOC== "VIL", DatPool$VAR, NA)
DatPool$VARpcr <- ifelse(DatPool$AOC== "PCR", DatPool$VAR, NA)

DatPool$MEANpcr[ is.na(DatPool$WTPpcr)] <- NA
DatPool$VARpcr[ is.na(DatPool$WTPpcr)] <- NA

library(stargazer)
## stargazer(DatPool[, c("WTP", "WTPreg", "WTPvil", "WTPpcr",
##                       "MEAN", "SCRreg", "SCRvil", "SCRpcr",
##                       "VAR", "VARreg", "VARvil", "VARpcr")],
##           type= "html", out= "Tables/TabSumStats.html")
stargazer(DatPool[, c("WTP", "WTPreg", "WTPvil", "WTPpcr",
                      "MEAN", "SCRreg", "SCRvil", "SCRpcr",
                      "VAR", "VARreg", "VARvil", "VARpcr")], type= "text")
#+end_src

#+RESULTS:
#+begin_example
==============================================================
Statistic   N    Mean  St. Dev.  Min  Pctl(25) Pctl(75)  Max  
--------------------------------------------------------------
WTP       1,815 9.644   6.359   0.000  5.500    12.500  42.000
WTPreg     625  6.765   4.628   0.000  4.000    9.000   38.000
WTPvil     625  9.480   5.599   0.000  6.000    12.900  37.000
WTPpcr     565  13.010  7.149   0.000  8.200    17.000  42.000
MEAN      1,875 4.924   3.159     0     1.5       8       10  
SCRreg     625  1.102   0.493   0.000  1.000    1.500   1.500 
SCRvil     625  5.102   1.069   3.000  4.500    6.000   6.500 
SCRpcr     525  8.568   0.791   7.500  8.000    9.000   10.000
VAR       1,875 1.504   1.039     0     0.5      1.7      4   
VARreg     625  1.190   0.565   0.000  1.000    1.667   1.667 
VARvil     625  2.430   0.966   0.500  1.667    3.500   3.500 
VARpcr     525  0.893   0.812   0.000  0.000    1.667   2.500 
--------------------------------------------------------------
#+end_example

#+LATEX: \clearpage

