Replication.md


<a id="org66a7339"></a>

# Regression analysis


<a id="org7946692"></a>

## Table SM1 cited in the paper

```R
library(lfe) ; library(texreg)
m1 <- felm(WTP~ AOC | 0  | 0 | ID, data= DatPool)
m2 <- felm(WTP~ AOC | ID | 0 | ID, data= DatPool)
m3 <- felm(WTP~ VIN0+ VIN1+ VIN2+ VIN3+ VIN4+ VIN5+ VIN7+ VIN8+ VIN9+ VIN10 
           | 0 | 0 | ID, data= DatPool)
m4 <- felm(WTP~ VIN0+ VIN1+ VIN2+ VIN3+ VIN4+ VIN5+ VIN7+ VIN8+ VIN9+ VIN10 
           | ID | 0 | ID, data= DatPool)
m5 <- felm(WTP~ VIN0+ VIN1+ VIN2+ VIN3+ VIN4+ VIN7+ VIN8+ VIN9+ AOC 
           | 0 | 0 | ID, data= DatPool)
m6 <- felm(WTP~ VIN0+ VIN1+ VIN2+ VIN3+ VIN4+ VIN7+ VIN8+ VIN9+ AOC 
           | ID | 0 | ID, data= DatPool)
screenreg(list(m1, m2, m3, m4, m5, m6))
```

    ===================================================================================================
                           Model 1      Model 2      Model 3      Model 4      Model 5      Model 6    
    ---------------------------------------------------------------------------------------------------
    (Intercept)               6.77 ***                 12.06 ***                  6.63 ***             
                             (0.41)                    (0.91)                    (0.43)                
    AOCVIL                    2.71 ***     2.71 ***                               2.80 ***     2.80 ***
                             (0.20)       (0.20)                                 (0.25)       (0.26)   
    AOCPCR                    6.25 ***     6.22 ***                               5.43 ***     5.41 ***
                             (0.40)       (0.40)                                 (0.78)       (0.55)   
    VIN0                                                1.70         1.73 **      1.70         1.73 ** 
                                                       (1.26)       (0.61)       (1.26)       (0.61)   
    VIN1                                               -0.14        -0.14        -0.14        -0.14    
                                                       (0.15)       (0.15)       (0.15)       (0.15)   
    VIN2                                                0.13 *       0.13         0.13 *       0.13    
                                                       (0.07)       (0.07)       (0.07)       (0.07)   
    VIN3                                                0.02         0.02         0.02         0.02    
                                                       (0.06)       (0.06)       (0.06)       (0.06)   
    VIN4                                                0.02         0.02         0.02         0.02    
                                                       (0.07)       (0.07)       (0.07)       (0.07)   
    VIN5                                               -2.63 ***    -2.61 ***                          
                                                       (0.67)       (0.38)                             
    VIN7                                               -0.04        -0.04        -0.04        -0.04    
                                                       (0.10)       (0.11)       (0.10)       (0.11)   
    VIN8                                                0.02         0.02         0.02         0.02    
                                                       (0.11)       (0.12)       (0.11)       (0.12)   
    VIN9                                                0.16         0.16         0.16         0.16    
                                                       (0.22)       (0.23)       (0.22)       (0.23)   
    VIN10                                              -5.43 ***    -5.41 ***                          
                                                       (0.78)       (0.55)                             
    ---------------------------------------------------------------------------------------------------
    Number  obs.              1815         1815         1815         1815         1815         1815       
    R^2 (full model)          0.16         0.89         0.16         0.89         0.16         0.89    
    R^2 (proj model)          0.16         0.59         0.16         0.60         0.16         0.60
    Adj. R^2 (full model)     0.16         0.88         0.16         0.89         0.16         0.89
    Adj. R^2 (proj model)     0.16         0.56         0.16         0.57         0.16         0.57    
    ===================================================================================================
    *** p < 0.001, ** p < 0.01, * p < 0.05


<a id="org1ecfc2c"></a>

## Table SM2 cited in the paper

```R
m1a <- felm(WTP~ MEAN+ VAR+ AOCPCR:VIN0 | 0  | 0 | ID, data= DatPool)
m1b <- felm(WTP~ MEAN+ VAR+ AOCPCR:VIN0 | ID | 0 | ID, data= DatPool)
m2a <- felm(WTP~ AOC+ MEAN+ AOCPCR:VIN0 | 0  | 0 | ID, data= DatPool)
m2b <- felm(WTP~ AOC+ MEAN+ AOCPCR:VIN0 | ID | 0 | ID, data= DatPool)
m3a <- felm(WTP~ AOC+ VAR+ AOCPCR:VIN0  | 0  | 0 | ID, data= DatPool)
m3b <- felm(WTP~ AOC+ VAR+ AOCPCR:VIN0  | ID | 0 |ID, data= DatPool)
m4a <- felm(WTP~ AOC+ MEAN+ VAR+ AOCPCR:VIN0| 0 | 0 | ID, data= DatPool)
m4b <- felm(WTP~ AOC+ MEAN+ VAR+ AOCPCR:VIN0| ID | 0 |ID, data= DatPool)
## htmlreg(list(m1a, m1b, m2a, m2b, m4a, m4b), file= "Tables/Reg2A.xls",
##         inline.css= F, doctype= T, html.tag= T, head.tag= T, body.tag= T)
screenreg(list(m1a, m1b, m2a, m2b, m4a, m4b))
```

    ===================================================================================================
                           Model 1      Model 2      Model 3      Model 4      Model 5      Model 6    
    ---------------------------------------------------------------------------------------------------
    (Intercept)               6.07 ***                  6.41 ***                  6.38 ***             
                             (0.42)                    (0.41)                    (0.41)                
    MEAN                      0.79 ***     0.79 ***     0.32 ***     0.36 ***     0.32 ***     0.36 ***
                             (0.05)       (0.05)       (0.09)       (0.05)       (0.09)       (0.05)   
    VAR                      -0.17 ***    -0.18 ***                               0.03         0.02    
                             (0.05)       (0.04)                                 (0.06)       (0.04)   
    AOCVIL                                              1.44 ***     1.28 ***     1.42 ***     1.27 ***
                                                       (0.39)       (0.26)       (0.37)       (0.26)   
    AOCPCR                                              2.98 **      2.69 ***     3.02 **      2.72 ***
                                                       (0.98)       (0.55)       (1.03)       (0.56)   
    AOCPCR:VIN0                                         1.46         1.46 *       1.45         1.46 *  
                                                       (1.25)       (0.61)       (1.26)       (0.61)   
    ---------------------------------------------------------------------------------------------------
    Number  obs.              1815         1815         1815         1815         1815         1815       
    R^2 (full model)          0.16         0.89         0.17         0.90         0.17         0.90    
    R^2 (proj model)          0.16         0.59         0.17         0.61         0.17         0.61
    Adj. R^2 (full model)     0.16         0.88         0.16         0.89         0.16         0.89
    Adj. R^2 (proj model)     0.16         0.56         0.16         0.58         0.16         0.58    
    ===================================================================================================
    *** p < 0.001, ** p < 0.01, * p < 0.05
