Replication.md


<a id="org03c10ed"></a>

## Table SM3 cited in the paper

```R
m5a <- felm(WTP~ AOC+ AOCREG:MEAN+ AOCVIL:MEAN+ AOCPCR:MEAN+ AOCPCR:VIN0
            | 0 | 0 | ID, data= DatPool)
m5b <- felm(WTP~ AOC+ AOCREG:MEAN+ AOCVIL:MEAN+ AOCPCR:MEAN+ AOCPCR:VIN0
            | ID | 0 | ID, data= DatPool)
m6a <- felm(WTP~ AOC+ MEAN+ AOCPCR:VIN0
            + AOCREG:VAR+ AOCVIL:VAR+ AOCPCR:VAR 
            | 0 | 0 | ID, data= DatPool)
m6b <- felm(WTP~ AOC+ MEAN+ AOCPCR:VIN0
            + AOCREG:VAR+ AOCVIL:VAR+ AOCPCR:VAR 
            | ID | 0 | ID, data= DatPool)
maa <- felm(WTP~ AOC+ AOCREG:MEAN+ AOCVIL:MEAN+ AOCPCR:VIN0
            + AOCREG:VAR + AOCVIL:VAR+ AOCPCR:VAR
            | 0 | 0 | ID, data= DatPool)
mbb <- felm(WTP~ AOC+ AOCREG:MEAN+ AOCVIL:MEAN+ AOCPCR:VIN0
            + AOCREG:VAR + AOCVIL:VAR+ AOCPCR:VAR
            | ID | 0 | ID, data= DatPool)
## htmlreg(list(m5a, m5b, m6a, m6b, maa, mbb), file= "Tables/Reg3A.xls",
##         inline.css= F, doctype= T, html.tag= T, head.tag= T, body.tag= T)
screenreg(list(m5a, m5b, m6a, m6b, maa, mbb))
```

    ===================================================================================================
                           Model 1      Model 2      Model 3      Model 4      Model 5      Model 6    
    ---------------------------------------------------------------------------------------------------
    (Intercept)               6.42 ***                  6.45 ***                  6.19 ***             
                             (0.47)                    (0.47)                    (0.45)                
    AOCVIL                    1.74 ***     1.74 ***     1.56 ***     1.65 ***     1.88 ***     1.66 ***
                             (0.35)       (0.37)       (0.33)       (0.36)       (0.43)       (0.43)   
    AOCPCR                    1.43         1.57         4.24 **      3.94 ***     6.17 ***     6.04 ***
                             (1.02)       (1.00)       (1.42)       (0.64)       (0.80)       (0.60)   
    AOCREG:MEAN               0.31         0.46 **                                4.08         0.06    
                             (0.24)       (0.16)                                 (3.89)       (2.36)   
    AOCVIL:MEAN               0.26 **      0.29 ***                               0.17         0.23 ***
                             (0.09)       (0.06)                                 (0.15)       (0.05)   
    AOCPCR:MEAN               0.51 ***     0.51 ***                               0.48 ***     0.47 ***                       
                             (0.10)       (0.11)                                 (0.11)       (0.10)                          
    AOCPCR:VIN0               1.32         1.35 *       1.65         1.63 **      1.84         1.87 ** 
                             (1.27)       (0.61)       (1.25)       (0.61)       (1.26)       (0.61)   
    MEAN                                                0.19         0.24 ***                          
                                                       (0.15)       (0.05)                             
    AOCREG:VAR                                          0.09         0.18        -3.29         0.34    
                                                       (0.12)       (0.14)       (3.31)       (2.01)   
    AOCVIL:VAR                                          0.21         0.14 *       0.22         0.14 *                       
                                                       (0.20)       (0.06)       (0.20)       (0.06)                        
    AOCPCR:VAR                                         -0.26        -0.21 *      -0.41 ***    -0.41 ***
                                                       (0.14)       (0.09)       (0.08)       (0.09)   
    ---------------------------------------------------------------------------------------------------
    Number  obs.              1815         1815         1815         1815         1815         1815       
    R^2 (full model)          0.17         0.90         0.17         0.90         0.17         0.90    
    R^2 (proj model)          0.17         0.61         0.17         0.61         0.17         0.61
    Adj. R^2 (full model)     0.16         0.89         0.16         0.89         0.16         0.89
    Adj. R^2 (proj model)     0.16         0.58         0.16         0.58         0.16         0.58    
    ===================================================================================================
    *** p < 0.001, ** p < 0.01, * p < 0.05
