Main.org
*** Table 3 in the paper

#+begin_src R :wrap example
## htmlreg(list(m1, m5, m1a, m4a, m5a, maa), omit= "VIN", file= "Tables/Fin3.xls",
##         inline.css= F, doctype= T, html.tag= T, head.tag= T, body.tag= T)
screenreg(list(m1, m5, m1a, m4a, m5a, maa), omit= "VIN")
#+end_src

#+Latex: {\small
#+RESULTS:
#+begin_example

===================================================================================================
                       Model 1      Model 2      Model 3      Model 4      Model 5      Model 6    
---------------------------------------------------------------------------------------------------
(Intercept)               6.77 ***     6.63 ***     6.17 ***     6.38 ***     6.42 ***     6.19 ***
                         (0.41)       (0.43)       (0.41)       (0.41)       (0.47)       (0.45)   
AOCVIL                    2.71 ***     2.80 ***                  1.42 ***     1.74 ***     1.88 ***
                         (0.20)       (0.25)                    (0.37)       (0.35)       (0.43)   
AOCPCR                    6.25 ***     5.43 ***                  3.02 **      1.43         6.17 ***
                         (0.40)       (0.78)                    (1.03)       (1.02)       (0.80)   
MEAN                                                0.79 ***     0.32 ***                          
                                                   (0.05)       (0.09)                             
VAR                                                -0.17 ***     0.03                              
                                                   (0.05)       (0.06)                             
AOCREG:MEAN                                                                   0.31         4.08    
                                                                             (0.24)       (3.89)   
MEAN:AOCVIL                                                                   0.26 **      0.17    
                                                                             (0.09)       (0.15)   
MEAN:AOCPCR                                                                   0.51 ***             
                                                                             (0.10)                
AOCREG:VAR                                                                                -3.29    
                                                                                          (3.31)   
AOCVIL:VAR                                                                                 0.22    
                                                                                          (0.20)   
AOCPCR:VAR                                                                                -0.41 ***
                                                                                          (0.08)   
---------------------------------------------------------------------------------------------------
obs.              1815         1815         1815         1815         1815         1815       
R^2 (full model)          0.16         0.16         0.16         0.17         0.17         0.17    
R^2 (proj model)          0.16         0.16         0.16         0.17         0.17         0.17
R^2 (full model)     0.16         0.16         0.16         0.16         0.16         0.16
R^2 (proj model)     0.16         0.16         0.16         0.16         0.16         0.16    
===================================================================================================
,*** p < 0.001, ** p < 0.01, * p < 0.05
#+end_example
#+LATEX: }\clearpage

** Figures
*** Figure 1

    Using the =ternary= package. 

#+Name:		Lst:TDB
#+Header:	:width 7 :height 6
#+begin_src R :results graphics :file "Figures/TriDistriB.pdf"
library(Ternary)
DatPool$SR <- ifelse(DatPool$FIXIN!= 1, DatPool$STRUCT,
                     paste0(as.numeric(substr(DatPool$STRUCT, 1, 1))- 1,
                            substr(DatPool$STRUCT, 2, 5)))
gg <- data.frame(SR= DatPool$SR,
                 model.matrix(~0+ DatPool$SR)/ 3)
hh <- aggregate(rep(1/ 3, nrow(gg)), by= list(gg$SR), sum)
hh <- data.frame(hh, as.numeric(substr(hh$Group.1, 1, 1)),
                 as.numeric(substr(hh$Group.1, 3, 3)),
                 as.numeric(substr(hh$Group.1, 5, 5)))
dpt <- list(as.numeric(hh[1, 3: 5]))
for (i in 2: nrow(hh)) dpt <- c(dpt, list(as.numeric(hh[i, 3: 5])))
par(mar= c(0, 0, 2, 0))
TernaryPlot(alab= '% PREMIER CRU -->', isometric= T,
            blab= '% VILLAGE -->', clab= '<--  % REGIONAL',
            grid.lty='solid', grid.col='white', 
            axis.col=rgb(0.6, 0.6, 0.6), ticks.col=rgb(0.6, 0.6, 0.6),
            main= "", col= "grey90",
            grid.minor.lines= 0, padding= .075)
Interest <- matrix(c( 40, 20, 40,
                      40, 60, 00,
                      00, 60, 40), ncol= 3, byrow= TRUE)
TernaryPolygon(Interest, col='grey80', border='grey')
AddToTernary(text, dpt, hh$x, cex=1.2, font=2)
#+end_src

#+RESULTS: Lst:TDB
#+ATTR_LaTeX: :options scale= .5
[[file:Figures/TriDistriB.pdf]]

#+Latex: \clearpage

*** Figure 2 color

    See the Appendix for the function =TernZoom=.

#+Name:		Lst:TRF2
#+Header:	:width 11 :height 9
#+begin_src R :results graphics :file "Figures/TriangleF2.pdf"
yop <- aggregate(DatPool$WTP,
                 by= list(DatPool$AOC, DatPool$SR), mean)
names(yop) <- c("VIN", "SR", "ValP")
yap1 <- merge(yop[yop$VIN== "PCR", c("SR", "ValP")],
              yop[yop$VIN== "VIL", c("SR", "ValP")], by= "SR")
yap2 <- merge(yap1, yop[yop$VIN== "REG", c("SR", "ValP")], by= "SR")
yap2$PCR <- as.numeric(substr(yap2$SR, 1, 1))
yap2$VIL <- as.numeric(substr(yap2$SR, 3, 3))
yap2$REG <- as.numeric(substr(yap2$SR, 5, 5))
yup <- yap2[order(yap2$REG, yap2$VIL, yap2$PCR), ]
yup$ValT <- (yup$PCR* yup$ValP.x+
             yup$VIL* yup$ValP.y+ yup$REG* yap2$ValP)/ 10
# png(filename= "Figures/TriangleF2.png", 
#    units="in", width= 11, height= 9, pointsize= 12, res=300)
par(mfrow= c(2, 2), mar= c(0, 0, 3, 0))
TernZoom(yup$ValP, "Average WTP for a bottle at Régional level")
AddToTernary(points, c(50, 25, 25), pch=21, cex=6.5)
TernZoom(yup$ValP.y, "AverageWTP of a bottle at Village level")
AddToTernary(points, c(50, 25, 25), pch=21, cex=6.5)
TernZoom(yup$ValP.x, "Average WTP for a bottle at Premier Cru level")
AddToTernary(points, c(50, 25, 25), pch=21, cex=6.5)
TernZoom(yup$ValT, "Average WTP for a average bottle on the area")
AddToTernary(points, c(0, 50, 50), pch=21, cex=6.5)
# dev.off()
#+end_src

#+Name: Fig:TRF2
#+ATTR_LaTeX: :options scale= .4
#+RESULTS: Lst:TRF2
[[file:Figures/TriangleF2.pdf]]

#+Latex: \clearpage

*** Figure 2 black and white

#+Name:		Lst:TRF3
#+Header:	:width 11 :height 9
#+begin_src R :results graphics :file "Figures/TriangleF3.pdf"
# png(filename= "Figures/TriangleF3.png", 
#     units="in", width= 11, height= 9, pointsize= 12, res=300)
par(mfrow= c(2, 2), mar= c(0, 0, 3, 0))
TernZoomBW(yup$ValP, "Average WTP for a bottle at Régional level")
AddToTernary(points, c(50, 25, 25), pch=21, cex=6.5)
TernZoomBW(yup$ValP.y, "AverageWTP of a bottle at Village level")
AddToTernary(points, c(50, 25, 25), pch=21, cex=6.5)
TernZoomBW(yup$ValP.x, "Average WTP for a bottle at Premier Cru level")
AddToTernary(points, c(50, 25, 25), pch=21, cex=6.5)
TernZoomBW(yup$ValT, "Average WTP for a average bottle on the area")
AddToTernary(points, c(0, 50, 50), pch=21, cex=6.5)
# dev.off()
#+end_src

#+Name: Fig:TRF3
#+ATTR_LaTeX: :options scale= .4
#+RESULTS: Lst:TRF3
[[file:Figures/TriangleF3.pdf]]

#+Latex: \clearpage

** Appendix
