Main.org
*** Function for ternary plots

#+begin_src R
TernZoom <- function(vecteur, lbl= ""){
    dpt2 <- list(c(0  , 2.5, 7.5), c(2.5, 0  , 7.5),  c(0  , 5  , 5  ),
                 c(2.5, 2.5, 5  ), c(5  , 0  , 5  ),  c(0  , 7.5, 2.5),
                 c(2.5, 5  , 2.5), c(5  , 2.5, 2.5),  c(7.5, 0  , 2.5),
                 c(0  , 10 , 0  ), c(2.5, 7.5, 0  ),  c(5  , 5  , 0  ),
                 c(7.5, 2.5, 0  ), c(10 , 0 , 0  ))
    TernaryPlot(alab= ' --> Percent of Premier Cru level --> ',
                blab= ' --> Percent of Village level --> ', col.lab= "red",
                clab= ' <-- Percent of Régional level <-- ', grid.lwd= 4,
                grid.lty='solid', col=rgb(.9, .9, .9), grid.col='white', 
                axis.col="white", ticks.col= "white", isometric= T,
                padding= 0.1, main= lbl, grid.minor.lines= 0,
                grid.line= 4,  axis.labels= F, point= 'down')
    TernaryLines(list(c(100,   0,   0), c(-10, 115, 0)),
                 lty= 3, lwd= 1.4, col= "chocolate1")
    TernaryLines(list(c( 75,   0,  25), c(-10, 85, 25)),
                 lty= 3, lwd= 1.4, col= "chocolate1")
    TernaryLines(list(c( 50,   0,  50), c(-10, 60, 50)),
                 lty= 3, lwd= 1.4, col= "chocolate1")
    TernaryLines(list(c( 25,   0,  75), c(-10, 35, 75)),
                 lty= 3, lwd= 1.4, col= "chocolate1")
    TernaryLines(list(c(  0,   0, 100), c(-10, 10,100)),
                 lty= 3, lwd= 1.4, col= "chocolate1")
    AddToTernary(text, c(-10, 114, 0), 40, col= "chocolate1")
    AddToTernary(text, c(-10, 85, 25), 30, col= "chocolate1")
    AddToTernary(text, c(-10, 60, 50), 20, col= "chocolate1")
    AddToTernary(text, c(-10, 35, 75), 10, col= "chocolate1")
    AddToTernary(text, c(-10, 10,100),  0, col= "chocolate1")
    TernaryLines(list(c(  0,  75,  25), c( 35, 75 , -10)),
                 lty= 3, lwd= 1.4, col= "darkcyan")
    TernaryLines(list(c( 0,  50,  50), c( 60, 50, -10)),
                 lty= 3, lwd= 1.4, col= "darkcyan")
    TernaryLines(list(c( 0,   25,  75), c(85, 25, -10)),
                 lty= 3, lwd= 1.4, col= "darkcyan")
    TernaryLines(list(c( 0,   0, 100), c(115, 0, -10)),
                 lty= 3, lwd= 1.4, col= "darkcyan")
    TernaryLines(list(c( 0, 100,  0),  c( 10, 100, -10)),
                 lty= 3, lwd= 1.4, col= "darkcyan")
    AddToTernary(text, c(10,100, -10), 20, col= "darkcyan")
    AddToTernary(text, c(35, 75, -10), 30, col= "darkcyan")
    AddToTernary(text, c(60, 50, -10), 40, col= "darkcyan")
    AddToTernary(text, c(85, 25, -10), 50, col= "darkcyan")
    AddToTernary(text, c(115, 0, -10), 60, col= "darkcyan")
    TernaryLines(list(c(  0, 100,  0), c( 0, -10, 115)),
                 lty= 3, lwd= 1.4, col= "blueviolet")
    TernaryLines(list(c( 25,  75, 0), c( 25, -10, 85)),
                 lty= 3, lwd= 1.4, col= "blueviolet")
    TernaryLines(list(c( 50,  50,  0), c(50, -10, 60)),
                 lty= 3, lwd= 1.4, col= "blueviolet")
    TernaryLines(list(c( 75,  25, 0), c(75, -10, 35)),
                 lty= 3, lwd= 1.4, col= "blueviolet")
    TernaryLines(list(c(100,   0, 0), c(100, -10, 9.99)),
                 lty= 3, lwd= 1.4, col= "blueviolet")
    AddToTernary(text, c( 0,-10, 115), 40, col= "blueviolet")
    AddToTernary(text, c(25,-10,  85), 30, col= "blueviolet")
    AddToTernary(text, c(50,-10,  60), 20, col= "blueviolet")
    AddToTernary(text, c(75,-10,  35), 10, col= "blueviolet")
    AddToTernary(text, c(100,-10, 9.99), 0, col= "blueviolet")
    AddToTernary(points, dpt2, pch= 21, col= 'white', bg= "white", cex=5)
    AddToTernary(text, dpt2, round(vecteur, 1), cex=1.25, font=2)
}
#+end_src

#+RESULTS:

*** Function for ternary plots black and white

#+begin_src R
TernZoomBW <- function(vecteur, lbl= ""){
    dpt2 <- list(c(0  , 2.5, 7.5), c(2.5, 0  , 7.5),  c(0  , 5  , 5  ),
                 c(2.5, 2.5, 5  ), c(5  , 0  , 5  ),  c(0  , 7.5, 2.5),
                 c(2.5, 5  , 2.5), c(5  , 2.5, 2.5),  c(7.5, 0  , 2.5),
                 c(0  , 10 , 0  ), c(2.5, 7.5, 0  ),  c(5  , 5  , 0  ),
                 c(7.5, 2.5, 0  ), c(10 , 0 , 0  ))
    TernaryPlot(alab= ' --> Percent of Premier Cru level --> ',
                blab= ' --> Percent of Village level --> ', col.lab= "red",
                clab= ' <-- Percent of Régional level <-- ', grid.lwd= 4,
                grid.lty='solid', col=rgb(.9, .9, .9), grid.col='white', 
                axis.col="white", ticks.col= "white", isometric= T,
                padding= 0.1, main= lbl, grid.minor.lines= 0,
                grid.line= 4,  axis.labels= F, point= 'down')
    TernaryLines(list(c(100,   0,   0), c(-10, 115, 0)), lty= 3, lwd= 1.4)
    TernaryLines(list(c( 75,   0,  25), c(-10, 85, 25)), lty= 3, lwd= 1.4)
    TernaryLines(list(c( 50,   0,  50), c(-10, 60, 50)), lty= 3, lwd= 1.4)
    TernaryLines(list(c( 25,   0,  75), c(-10, 35, 75)), lty= 3, lwd= 1.4)
    TernaryLines(list(c(  0,   0, 100), c(-10, 10,100)), lty= 3, lwd= 1.4)
    AddToTernary(text, c(-10, 114, 0), 40)
    AddToTernary(text, c(-10, 85, 25), 30)
    AddToTernary(text, c(-10, 60, 50), 20)
    AddToTernary(text, c(-10, 35, 75), 10)
    AddToTernary(text, c(-10, 10,100),  0)
    TernaryLines(list(c(  0,  75,  25), c( 35, 75 , -10)),lty= 3, lwd= 1.4)
    TernaryLines(list(c( 0,  50,  50), c( 60, 50, -10)), lty= 3, lwd= 1.4)
    TernaryLines(list(c( 0,   25,  75), c(85, 25, -10)), lty= 3, lwd= 1.4)
    TernaryLines(list(c( 0,   0, 100), c(115, 0, -10)), lty= 3, lwd= 1.4)
    TernaryLines(list(c( 0, 100,  0),  c( 10, 100, -10)), lty= 3, lwd= 1.4)
    AddToTernary(text, c(10,100, -10), 20)
    AddToTernary(text, c(35, 75, -10), 30)
    AddToTernary(text, c(60, 50, -10), 40)
    AddToTernary(text, c(85, 25, -10), 50)
    AddToTernary(text, c(115, 0, -10), 60)
    TernaryLines(list(c(  0, 100,  0), c( 0, -10, 115)), lty= 3, lwd= 1.4)
    TernaryLines(list(c( 25,  75, 0), c( 25, -10, 85)), lty= 3, lwd= 1.4)
    TernaryLines(list(c( 50,  50,  0), c(50, -10, 60)), lty= 3, lwd= 1.4)
    TernaryLines(list(c( 75,  25, 0), c(75, -10, 35)), lty= 3, lwd= 1.4)
    TernaryLines(list(c(100,   0, 0), c(100, -10, 9.99)), lty= 3, lwd= 1.4)
    AddToTernary(text, c( 0,-10, 115), 40)
    AddToTernary(text, c(25,-10,  85), 30)
    AddToTernary(text, c(50,-10,  60), 20)
    AddToTernary(text, c(75,-10,  35), 10)
    AddToTernary(text, c(100,-10, 9.99), 0)
    AddToTernary(points, dpt2, pch= 21, col= 'white', bg= "white", cex=5)
    AddToTernary(text, dpt2, round(vecteur, 1), cex=1.25, font=2)
}
#+end_src

#+RESULTS:

** Code for INAO                             :noexport:
*** Descriptive stats
